```
* 选择题
> 15个 每个1分
> 教材后面

* 填空题
> 10道题，20空，共10分

* 判断题
>(错的多？？)

* 问答题
> 20~25分

* 应用题
> 参考实验题  
  
* 具体
	* 路由器组成和哪些接口
	* 启动过程
	* 配置方法 配置模式 命令 带内 带外
	* 路由器基本功能 直通式 支线隔离
	* vlan基本概念 划分方法（端口）
	* 交换式局域网配置
	* vlan间通讯
	* 静态路由 P35 P36 P38
	* trank链路
	* P60 端口安全
	* lip(要求低)
	* P101 基本概念 特性 
	* P102 理解 
	* P108(粗略）
	* 广域网（较少）P169
	* ACL 标准的 扩展的
```
## 第一章
### 1.1路由器基础
* 硬件
	* CPU
		> **负责路由器的配置管理，维护路由表，选择最佳路由和转发数据包**
	* ROM
		> **保存加电自检指令，自举程序，路由器操作系统的引导**。负责路由器的引导和诊断
	* RAM
		> 在路由器运行期间**保存临时文件**
	* NVRAM(非易失性内存)
		> 保存路由器启动时**读入的配置文件**
	* FLASH(闪存)
		> 保存**IOS操作系统文件**，相当于硬盘
	* 接口
	* 端口
	* 辅助端口
	* 线缆
* 软件
	* 系统
	* 配置文件
* 路由器通过**console**口进行配置

### 1.2路由器启动过程
* **加电自检**
* **软件初始化** 加载并运行ROM中的BootStrap启动程序，进行初步引导工作。
* **定位并加载IOS系统文件**
* **搜索保存的配置文件**
	* 存在：调入RAM逐条执行
	* 不存在：
		* 设置路由器名
		* 设置进入特权模式的密码
		* 设置虚拟终端访问的密码
		* 询问是否要设置路由器支持的各种网络协议
		* 配置FastEthernet0/0接口
		* 配置serial0接口
* **运行经过配置的ISO软件**

### 1.3 CDP协议
* CDP协议是Cisco专有协议，是使**Cisco网络设备能够发现相邻、直连的其他Cisco设备**的协议，是**数据链路层**协议，默认启动的。

### 1.4 路由器工作原理
* IP分为两部分：**网络号和主机号**，并用子网掩码来**划分IP地址中的网络号和主机号**，子网掩码中**数字1对应的IP地址部分为网络号**，**数字0对应部分为主机号**。
* 路由器适用于多个逻辑上分开的网络，每个接口上对应一个不同的IP地址，其对应了不同的IP子网。
<br>

#### 工作原理
1. 子网1中的路由器A通过自己的网络把数据帧送到所连接的路由器上  **等包**
2. 路由器收到数据帧后，先拆帧，取出其中的IP包，找到IP包中的目标IP地址 **拆帧**
3. 路由器根据此IP地址查找路由表，找到目标子网所连接的路由器杰接口 **查表**
4. 路由器产生新的数据帧，在将该数据帧转发到对应的子网上 **封帧 转发**

### 1.5 路由表
* 保存在RAM里面
* **目标网络字段/掩码字段**：找到目标主机所在的网络地址和子网掩码信息
* **管理距离/度量值字段**：指出该路由条目的可信程度及到达目标网络所花费的代价
* **下一跳地址字段**：指出被路由的数据包将被送到的下一跳路由器的入口地址
* **路由更新时间字段**：指出上一次收到此路由信息所经过的时间
* **输出接口字段**：指出到目标网络去的数据包从本路由器的哪个接口发出

### 1.6 路由决策原理
* 最长匹配原理
	> 当有多条路径到达目标时，**以其IP地址或网络号最长匹配的**作为最佳路由
* 最小管理距离优先
	> 在相同匹配长度情况下，**按照路由的管理距离选择**，管理距离越小，路由越优先
* 度量值最小优先
	> 在匹配长度、管理距离都相同时，**比较路由的度量值**，度量值越小越优先。不同的路由协议定义度量值的方法不一样，RIP使用条数一个因子作为路由的度量标准，另外一些路由则基于 条数、带宽、延时、负载、可靠性和代价等。
* 路由负载均衡
	> 当路由器有两个以上的路径，它们都通往同一个目的网络，并且其管理距离与度量都相等时，路由器会同时使用多条路径转发数据包，这被称为(等价)负载均衡。可提高网络的效率和性能。

## 第二章
### 2.1 IP路由选择协议
* 静态路由是在管理配置路由器时设置的固定的路由表。一般由于规模不大、拓扑结构固定的网络中。
* 通常在网络中动态路由作为静态路由的补充，寻址时首先查找静态路由，没有找到则查找相应的动态路由。
* 根据是否在一个自治域内部使用，动态路由协议分为内部网关协议和外部网关协议。自治域是指一个具有统一管理机构、统一路由策略的网络。
	* 自治域内部采用的路由选择协议称为内部网关协议，常用的有：RIP、OSPF、IGRP和IS-IS等
	* 外部网关协议朱勇用于多个自治与之间的路由选择，常见的有：BGP、BGP-4

* 分类
	* 动态路由： 静态路由、动态路由
	* 静态路由： 直连路由、手工配置静态路由、默认路由
	* 动态路由： 内部网关协议、外部网关协议
		* 按照算法角度划分：
			* 距离矢量路由协议：RIP
			* 链路状态路由协议：OSPF

* 路由选择协议的功能
	* 获取网络拓扑结构信息
	* 构建路由表
	* 选择到达每个目的网络的最优路径

### 2.2 静态路由
* 必须由管理员手工配置，不能动态反映网络拓扑变化，**简单、路由器负载小、可控性强**，在所有路由中，静态路由**优先级最高**

#### 2.2.1 直连路由
* 一旦定义了路由器的接口IP地址，并启用了此接口，路由器就自动产生激活接口IP所在网段的直连路由信息
* 每个接口都必须单独占用一个网段，几个接口不能同属一个网段
* 只能发现本接口所属网段的路由

#### 2.2.2 默认路由
指的是路由器在路由表中如果找不到到达目的网络的具体路由时最后所选择的路由。默认路由在存根网络（只有一个出口的网络）中应用最多。
* 概述
	* 0.0.0.0/0可以匹配所有的IP地址，属于最不精确的匹配
	* 默认路由可以看做静态路由的一种特殊情况
	* 当所有的已知路由信息都查不到数据包如何转发时，按默认路由信息进行转发
<br>
<br>
<br>

#### 2.2.2.3 默认路由配置

```
添加：
router(config)#ip route [网络编号][子网掩码][下一跳路由器IP地址/本地接口]
删除：
router(config)#no ip route [网络编号][子网掩码][下一跳路由器IP地址/本地接口]
```

#### 3.5 默认路由配置
```
router(config)#ip route 0.0.0.0 0.0.0.0 [下一跳路由器IP地址/本地接口]
```

### 问答

* 路由动作包括哪两项基本内容？各自的意义是什么？
	> **寻径和转发**。寻径：判断到达目的的最佳路径
* 典型的路由选择方式有哪两种？含义是什么？
	> 动态路由协议，静态路由协议；
	>  必须由管理员手工配置,只要管理员不对其进行改变，就不会改变，不能动态反映网络拓扑变化，简单、路由器负载小、可控性强，在所有路由中，静态路由优先级最高
	> 通过运行路由选择协议，使网络中路由器相互通信，传递路由信息，利用收到的路由信息动态更新路由表的过程。它能实时地适应网络拓扑结构的变化。

## 第三章 RIP路由协议
### 3.1 RIP理论基础
* RIP使用最广泛的路由选择协议，采用**距离矢量算法，其度量是基于条数来表示，每经过一台路由器，路径跳数加1**。它允许的最大跳数为15，任何超过15的跳数将被标记为不可达。另外，RIP每隔30s向UDP端口520发送一次路由信息广播。公布自己的全部路由表，每一个2ip数据包。一个指令，一个版本号和一个路由与以及最多25条路由信息。因而容易造成网络广播风暴影响收敛速度，所以**RIP只适合于小型的同构网络**。

#### 3.1.1 RIP的两个版本RIP v1和RIP v2
* 共同特性
	* 以到达目的地了网络最小跳数作为路由选择度量标准，而不是以链路带宽和延迟进行选择。
	* 最大跳数为15条。这限制了网络的规模
	* 默认路由更新周期为30s,同时支持触发更新并使用UDP协议的word and端口
	* 管理距离为120
	* 支持等价路径（在等价路径上负载均衡），默认为4条，最大为6条。
* RIP缺点：
	* 以跳数作为度量，会选择非最优路径。
	* 度量值最大为16，限制了网络的规模。
	* 可靠性差，他接受来自任何设备的更新。
	* 收敛速度慢通常需要五分钟左右。容易造成路由环路。
	* 因发送全部路由表中的信息，rip协议占用太多的带宽。
#### 3.1.2 RIP工作过程
* Rip启动时，初始rip数据库仅包含本路由器声明的直连路由。
* Rip协议启动后向各个接口广播或组播RIP一个请求报文。
* 邻居路由器的rip协议从某接口收到此请求报文。根据自己的rip数据库形成rip更新报文。向该接口对应的网络广播。
* Rip接受到邻居路由器回复的包含邻居路由器rip数据库的更新报文后，重新生成自己的rip数据库。
* Rip的Metric以跳数为计算标准，最大有效超市为15条。16条为无穷大，代表无效。
* Rip以来三种定时器维护其rip数据库的路由信息的更新：**更新定时器为30秒**。路由失效定时器为180秒。清除路由条目时间为240秒。

#### 3.1.3 路由环路
* 距离矢量路由协议通过定期广播路由表来跟踪互联网的变化。收敛慢，因此每台路由器不能同时或接近同时完成录入表的更新。因而产生了不协调或者矛盾的路由选择条目就会发生路由环路问题。导致用户的数据包不停地在网络上循环发送。造成网络资源的严重浪费。解决路由环路问题有六种方法。
* 定义最大值
* 水平分割
* 路由中毒
* 反向中毒
* 抑制更新时间
* 触发更新
![路由环路解决方法](https://cdn.jsdelivr.net/gh/cloud-r/GitakRepository/static_files/blog/img/20200522011206.png)
#### 3.1.4 Rip中的定时器
* 更新定时器
* 无效计时器
* 抑制计时器
* 废除计时器
* 触发更新计时器

### 3.2 RIP的配置

### 3.3 验证RIP
```
清除路由表
   Router#clear ip route *
查看路由表
   Router#show ip route [rip]
查看路由协议配置
   Router#show ip protocols
在控制台开启/关闭RIP的调试状态
   Router#debug ip rip
   Router#undebug ip rip
```




## 第4章 OSPF协议
### 4.1 基本概念
*  OSPF是一种典型的链路状态路由协议。启用OSPF协议的路由器彼此交换并保存整个网络的链路信息。从而掌握全网的拓扑结构，再通过OSPF算法计算出到达每个网络的最佳路由。
* OSPF使用开销(Cost)作为度量；借助链路状态数据库来保存当前网络拓扑结构信息——在同一区域中的所有路由器上是相同的。
* OSPF区域是在其链路状态数据库中共享相同链路状态信息的一组路由器。
* OSPF特性
	* 支持大型网络、路由收敛块、占用网络资源少
	* 无路由环路
	* 支持VLSM和CIDR
	* 支持等价路由
	* 支持区域划分，构成结构化的网络，提供路由分级管理


## 第5章 NAT

### 5.1 配置
#### 5.1.1 静态NAT
```
指定端口：
Router(config)#int g0/0
Router(config-if)#ip nat inside		//定义入口
Router(config-if)#exit
Router(config)#int g0/1
Router(config-if)#ip nat outside	//定义出口
Router(config-if)#exit

映射：
Router(config)#ip nat inside source static 192.168.1.11 200.200.2.11 //静态
Router(config)#ip nat inside source static 192.168.1.21 200.200.2.21
Router(config)#ip route 0.0.0.0 0.0.0.0 g0/1
Router(config)#end
```
#### 5.1.2 动态NAT
```
Router(config)#ip route 0.0.0.0 0.0.0.0 g0/1 	//设置默认路由
Router(config)#ip nat pool p1 200.200.2.10 202.200.2.11 netmask 255.255.255.0 	//从11~12两个公网地址
Router(config)#access-list 1 permit 192.168.1.0 0.0.0.255	 //允许192.168192.168.1.0通过
Router(config)#ip nat inside source list 1 pool p1 	//连接

```

## 第7章 [ACL](https://blog.csdn.net/weixin_42442713/article/details/80925110)
### 7.1概述
* 分类
	* 标准ACL:根据**源IP地址**允许或拒绝流量。数据包中包含的目的地址和端口无关紧要。   
	* 扩展ACL:根据**多种属性**（例如，协议类型、源和 IP 地址、目的 IP 地址、源 TCP 或 UDP 端口、目的 TCP 或 UDP 端口）过滤 IP 数据包，并可依据协议类型信息（可选）进行更为精确的控制。

* ACL优点
	* **限制网络流量以提高网络性能**
		>如果禁止在网络中传输视频流量，那么应配置和应用ACL阻止视频流量，可显著降低网络负载并提高网络性能。
	* **提供流量控制**
		>ACL可以限制路由更新的传输。如果网络状况不必更新，可节约带宽。
	* **提供基本的网络访问安全性。**
		>ACL可以允许一台主机访问部分网络，同时阻止其它主机访问该区域。
	* **根据流量类型过滤流量**
		>ACL可允许电子邮件流量，但阻止所有Telnet流量。
	* **屏蔽主机以允许或拒绝对特定网络服务的访问**
		>ACL可允许或拒绝用户访问特定协议类型(如FTP或HTTP)。

* 基本原则
	* **最小特权原则**：只给受控对象完成任务所必需的的最小的特权
	* **最靠近受控对象原则**：所有的网络层访问权限控制尽可能离受控对象最近

* 局限性
	* 无法识别到具体的人
	* 无法识别到应用内部的权限级别
	* 解决办法：和系统及应用的访问权限控制结合使用


### 7.2 配置

* 标准ACL
	* 配置规则 
		* **Router(config)#access-list access-list-number {remark | permit | deny} protocol source source-wildcard [log]**
	* 关联到具体接口
		* **Router(config-if)#ip access-group access-list-number  {in | out}**

	```
	Router(config)#access-list access-list-number {remark | permit | deny} protocol source source-wildcard [log]

	Router(config)#access-list 1 deny 192.168.2.0 0.0.0.255
	Router(config)#access-list 1 permit 192.168.1.0 0.0.0.255 
	```

* 扩展ACL
	```
	R2(config)#access-list 100 permit tcp host 12.1.1.1 any eq 23         扩展ACL的配置第一步，第一条是允许tcp端口为23的telnet服务通过

	R2(config)#access-list 100 deny icmp any any                          第二条是禁止icmp

	R2(config)#access-list 100 permit ip any any                          第三条是允许数据包通过

	R2(config)#int s0/0                                                   配置扩展ACL的第二步

	R2(config-if)#ip access-group 100 in



	//ftp协议有两个端口
	Router(config)#access-list 100 permit tcp 192.168.1.0 0.0.0.255 192.168.2.0 0.0.0.255 eq 20
	Router(config)#access-list 100 permit tcp 192.168.1.0 0.0.0.255 192.168.2.0 0.0.0.255 eq 21
	Router(config)#access-list 100 permit tcp 192.168.1.0 0.0.0.255 host 192.168.2.10 eq 80	//允许子网访问Server0的www服务
	Router(config)#access-list 100 deny tcp 192.168.1.0 0.0.0.255 host 192.168.2.20 eq 80
	//不允许子网访问Server1的www服务
	Router(config)#exit

	```
 ### 7.3 在路由器上应用ACL的规则/注意事项
* **每一种协议一个ACL**
	>要控制接口上的流量，必须为接口上启用的每种网络协议定义相应的ACL。 
* **每一个方向一个ACL**
	>一个ACL只能控制接口上一个方向的流量。要控制入站流量和出站流量，必须分别定义两个ACL。 
* **每一个接口一个ACL**
	>一个ACL只能控制一个接口上的流量。
* **一切未指明的流量默认被禁止**。
	>在标准ACL末尾添加access-list 编号 permit  any    
	>在扩展ACL末尾添加access-list 编号 permit  ip  any  any
* **自顶向下的匹配方式，一旦匹配成功就停止比较**。
	>更具体(严格)的语句应放在不严格(不具体)的前面。
* **新语句被添加至编号ACL的末尾，不能改语句顺序**。
* **应尽量使数据包进入低带宽(串行)链路之前被过滤掉**。



<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>
<br>

### 第一章    
* 选择题  
|题号|1|2|3|4|5|6|7|8|9|10|11|12|13|14|
|-|-|-|-|-|-|-|-|-|-|-|-|-|-|-|
|答案|A|C|D|A|A|A|B|C|C|B|D|C|C|A
* 问答题
	* 交换机如何完成数据帧交换
	```
		1. 交换机根据收到的数据帧的源MAC地址建立地址同交换机端口的映射,并写入Mac地址表中；
		2. 交换机将数据帧中的目的Mac地址同已经建立的Mac地址表经比较，决定由哪个端口进行转发；
		3. 数据帧中的Mac地址不在Mac地址表中则向所有端口转发
		4. 广播帧和组播帧向所有的端口转发。
	```
	* 交换机的存储介质
	```
		RAM ROM 闪存 非易失性内存
	```
	* 交换机歌类型的端口
	```
		1. 两层端口：
			1.1 Access端口：直接连接PC,只能属于某一个VLAN
			1.2 Trunk端口：把二层端口设定为trunk端口。此端口只能连接二层交换机或三层交换机或路由器。不能连接PC.Trunk端口允许所有VLAN通过。
			1.3 二层聚合端口：把几个物理端口聚合端口聚在一起作为一个逻辑端口，目的是提高贷款、均衡负载、提供冗余备份等。
		2. 三层端口
			2.1 交换机虚拟端口：是三层交换机中VLAN的IP地址，代表这个VLAN中所有的PC的网关。
			2.2 路由端口：是三层交换机的路由端口，像路由器的端口一样，该端口可以连接一个网络，三层交换机的所有路由端口必须属于不同的网路。
			2.3 三层聚合端口：把三层交换机的几个物理端口聚合在一起形成一个逻辑端口，该逻辑端口是三层路端口，能直接分配一个IP地址。
	```
	* 交换机加电后的启动过程
	```
		1. 加电自检
		2. 软件初始化,加载并运行ROM中的BootStrap启动程序，进行初步引导工作。
		3. 定位并加载IOS系统文件
		4. 搜索保存的配置文件
			* 存在：调入RAM逐条执行
			* 不存在：
				* 设置路由器名
				* 设置进入特权模式的密码
				* 设置虚拟终端访问的密码
				* 询问是否要设置路由器支持的各种网络协议
				* 配置FastEthernet0/0接口
				* 配置serial0接口
		5. 运行经过配置的ISO软件
	```
	* 交换机的配置模式
	```
		1. 用户模式
		2. 特权模式
		3. 全局模式
		4. 子模式
	```
	* 路由器由哪些硬件和软件组成	
	```	
		* 硬件
			* CPU
				> **负责路由器的配置管理，维护路由表，选择最佳路由和转发数据包**
			* ROM
				> **保存加电自检指令，自举程序，路由器操作系统的引导**。负责路由器的引导和诊断
			* RAM
				> 在路由器运行期间**保存临时文件**
			* NVRAM(非易失性内存)
				> 保存路由器启动时**读入的配置文件**
			* FLASH(闪存)
				> 保存**IOS操作系统文件**，相当于硬盘
			* 接口
			* 端口
			* 辅助端口
			* 线缆
		* 软件
			* 系统
			* 配置文件
	```
	* 路由器的接口分为哪几种
	```
		* 局域网接口
		* 广域网接口
		* 配置接口
	```
	* 简述路由器的工作过程
	```
		1. 子网1中的路由器A通过自己的网络把数据帧送到所连接的路由器上  **等包**
		2. 路由器收到数据帧后，先拆帧，取出其中的IP包，找到IP包中的目标IP地址 **拆帧**
		3. 路由器根据此IP地址查找路由表，找到目标子网所连接的路由器杰接口 **查表**
		4. 路由器产生新的数据帧，在将该数据帧转发到对应的子网上 **封帧 转发**
	```
	* 什么是路由
	```
		1. 路由是指路由器从一个接口上收到数据包，根据数据路由包的目的地址进行定向并转发到另一个接口的过程。
	```
	* 路由动作包括哪两项基本内容
	```
		寻径：   
			判定到达目的地的最佳路径，由路由选择算法来实现
		转发：
	```
	* 典型的路由选择方式有哪两种 其意义是
	```
		* 最长匹配原则：以IP地址或网络号最长匹配作为最佳路由。
		* 最小管理距离优先：按照路由的管理距离选择，管理距离越小，路由越优先。
	```
	* 简述路由决策的规则及意义
	```
		首先最长匹配原则进行选择，在相同长度的情况下，按照路由的管理距离选择，管理距离越小，路由越优先。当匹配长度和管理距离都相同时，比较路由的度量值，度量值越小越优先。

		路由器根据路由表中的信息，根据路由决策规则选择一条最佳的路径，将数据转发出去。
	```
	* 解释路由表中各字段的含义
	```
		1. 目标网络字段/掩码字段：找到目标主机所在的网络地址和子网掩码信息
		2. 管理距离/度量值字段：指出该路由条目的可信程度及到达目标网络所花费的代价
		3. 下一跳地址字段：指出被路由的数据包将被送到的下一跳路由器的入口地址
		4. 路由更新时间字段：指出上一次收到此路由信息所经过的时间
		5. 输出接口字段：指出到目标网络去的数据包从本路由器的哪个接口发出
	```
***

### 第二章
* 选择题        
	|题号|1|2|3|4|5|6|7|8|9|10|
	|-|-|-|-|-|-|-|-|-|-|-|
	|答案|D|A|A|C|A|D|D|B|C|C|
* 问答题
	* 简述静态路由的配置方法和过程
	```
		1、为路由器每个接口配置IP地址
		2、确定本路由器有哪些直连网段的路由信息
		3、确定网络中有哪些属于本路由器的非直连网段
		4、添加本路由器的非直连网段相关的路由信息

		router(config)#ip route [网络编号][子网掩码][下一跳路由器IP地址/本地接口]
	```
	* 路由选择协议按算法分为哪两种？分别有哪些代表性协议
	```
		1. 距离矢量路由协议：
			1.1 路由器只向邻居发送路由信息报文；
			1.2 路由器将更新后的完整路由信息报文发送给邻居；
			1.3 路由器根据接收到的信息报文计算产生路由；

			RIP、IGRP、BGP
		
		2. 链路状态路由协议
			2.1 对网络发生的变化能够快速响应，发送触发式更新；
			2.2 当链路状态发生变化后，检测到变化的设备创建一份LSA，通过使用组播地址传送给所有的邻居，每个邻居复制一份LSA，更新它自己的链路状态数据库LSDB,随后再转发LSA给其他的邻居。
			2.3 发送周期性更新，间隔时间为10s

			OSPF、IS-IS
		
		EIGRP是距离矢量路由协议和链路状态协议的综合
			

	```


## 配置

### 1. 静动态路由配置

* 1.1 静态
```
Router>en
Router#conf ter
Router(config)#int g0/0
Router(config-if)#ip add 192.168.1.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit
Router(config)#int g0/1
Router(config-if)#ip add 192.168.2.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router0：
Router(config)#ip route 192.168.7.0 255.255.255.0 192.168.6.2 //从下一个路由器的6.2口传入  对应的主机网段为7.0

```

* 1.2 RIP
```
Router>en
Router#conf ter

Router(config)#int g0/0
Router(config-if)#ip add 192.168.1.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int g0/1
Router(config-if)#ip add 192.168.2.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#router rip
Router(config-router)#network 192.168.1.0  //路由器连接的两个端口的网段
Router(config-router)#network 192.168.2.0  //路由器连接的两个端口的网段
Router(config-if)#exit
```

* OSPF
```
Router>en
Router#conf ter
Router(config)#int g0/0
Router(config-if)#ip add 192.168.1.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit
Router(config)#int g0/1
Router(config-if)#ip add 192.168.2.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#router ospf 1
Router(config-router)#network 192.168.1.0 0.0.0.255 area 0 //路由器连接的两个端口的网段
Router(config-router)#network 192.168.2.0 0.0.0.255 area 0 //路由器连接的两个端口的网段
Router(config-router)#exit
Router1：
Router>en
```

### 2.NAT
* 静态NAT
![图片.png](https://i.loli.net/2020/06/04/b381fOHYF6cgEkN.png)
```
Router>en
Router#conf ter
Router(config)#int g0/0
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int g0/1
Router(config-if)#ip address 200.200.2.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit


Router(config)#int g0/0
Router(config-if)#ip nat inside
Router(config-if)#exit

Router(config)#int g0/1
Router(config-if)#ip nat outside
Router(config-if)#exit

Router(config)#ip nat inside source static 192.168.1.11 200.200.2.11 //192.168.1.11 映射到  200.200.2.11 
Router(config)#ip nat inside source static 192.168.1.21 200.200.2.21 //192.168.1.21 映射到  200.200.2.21
Router(config)#ip route 0.0.0.0 0.0.0.0 g0/1
Router(config)#end
```
* 动态NAT
![图片.png](https://i.loli.net/2020/06/04/Bilvrcwh9UtQHkD.png)
```
Router>en
Router#conf ter
Router(config)#int g0/0
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int g0/1
Router(config-if)#ip address 202.200.2.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int g0/0
Router(config-if)#ip nat inside
Router(config-if)#exit

Router(config)#int g0/1
Router(config-if)#ip nat outside
Router(config-if)#exit

Router(config)#ip route 0.0.0.0 0.0.0.0 g0/1 	//设置默认路由
Router(config)#ip nat pool p1 200.200.2.10 202.200.2.11 netmask 255.255.255.0 	//从11~12两个公网地址
Router(config)#access-list 1 permit 192.168.1.0 0.0.0.255	 //允许192.168192.168.1.0通过
Router(config)#ip nat inside source list 1 pool p1 	//连接
```

* PAT
![图片.png](https://i.loli.net/2020/06/04/uO6ZhTwXgFG3ciR.png)
```
Router>en
Router#conf ter
Router(config)#int g0/0
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int g0/1
Router(config-if)#ip address 202.200.2.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#ip route 0.0.0.0 0.0.0.0 g0/1 //标识(允许)那些将要进行转换的内部本地地址
Router(config)#access-list 1 permit 192.168.1.0 0.0.0.255
Router(config)#ip nat inside source list 1 interface g0/1 overload

Router(config)#int g0/0
Router(config-if)#ip nat inside
Router(config-if)#exit
Router(config)#int g0/1
Router(config-if)#ip nat outside
Router(config-if)#exit

```

### 3.ACL
* 标准ACL
![图片.png](https://i.loli.net/2020/06/04/posKibFrAYRLTZ6.png)
```
Router0:
Router>en
Router#conf ter
Router(config)#int f0/0
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int f0/1
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int f1/0
Router(config-if)#ip address 192.168.3.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#router rip
Router(config-router)#network 192.168.1.0
Router(config-router)#network 192.168.2.0
Router(config-router)#network 192.168.3.0


Router1:
Router>en
Router#conf ter
Router(config)#int f0/0
Router(config-if)#ip address 192.168.4.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int f0/1
Router(config-if)#ip address 192.168.3.2 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#router rip
Router(config-router)#network 192.168.3.0
Router(config-router)#network 192.168.4.0
Router(config-router)#exit

Router(config)#int f0/0
Router(config-if)#ip access-group 1 out
Router(config-if)#exit
Router(config)#access-list 1 deny 192.168.2.0 0.0.0.255
Router(config)#access-list 1 permit 192.168.1.0 0.0.0.255
Router(config)#exit
```

* 扩展ACL

![image.png](https://i.loli.net/2020/06/04/WCTeiq7GV59A4Ud.png)
```
Router0：
Router>en
Router#conf ter
Router(config)#int g0/0
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int g0/1
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shut
Router(config-if)#exit

Router(config)#int g0/0
Router(config-if)#ip access-group 100 in
Router(config-if)#exit

Router(config)#access-list 100 permit tcp 192.168.1.0 0.0.0.255 192.168.2.0 0.0.0.255 eq 20 //ftp协议有两个端口
Router(config)#access-list 100 permit tcp 192.168.1.0 0.0.0.255 192.168.2.0 0.0.0.255 eq 21

Router(config)#access-list 100 permit tcp 192.168.1.0 0.0.0.255 host 192.168.2.10 eq 80	//允许子网访问Server0的www服务
Router(config)#access-list 100 deny tcp 192.168.1.0 0.0.0.255 host 192.168.2.20 eq 80 	//不允许子网访问Server1的www服务

Router(config)#exit
```

### 4.VLAN
![image.png](https://i.loli.net/2020/06/04/unfhsyxjYBo1bDE.png)
```
Switch0:
Switch>en
Switch#conf ter
Switch(config)#vlan 10
Switch(config-vlan)#name vlan10
Switch(config-vlan)#exit
Switch(config)#int f0/1
Switch(config-if)#switchport access vlan 10
Switch(config-if)#exit
Switch(config)#int f0/2
Switch(config-if)#switchport access vlan 10
Switch(config-if)#exit
Switch(config)#int f0/3
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit

Switch1:
Switch>en
Switch#conf ter

Switch(config)#vlan 20
Switch(config-vlan)#name vlan20
Switch(config-vlan)#exit

Switch(config)#int f0/1
Switch(config-if)#switchport access vlan 20
Switch(config-if)#exit

Switch(config)#int f0/2
Switch(config-if)#switchport access vlan 20
Switch(config-if)#exit

Switch(config)#int f0/3
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit

Switch(config)#int f0/4
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit

Switch2:
Switch>en
Switch#conf ter

Switch(config)#vlan 20
Switch(config-vlan)#name vlan20
Switch(config-vlan)#exit

Switch(config)#int f0/1
Switch(config-if)#switchport access vlan 20
Switch(config-if)#exit

Switch(config)#int f0/2
Switch(config-if)#switchport access vlan 10
Switch(config-if)#exit

Switch(config)#int f0/3
Switch(config-if)#switchport mode trunk
Switch(config-if)#exit
```








